#include <stdio.h>

int main() {
    printf("sizeof(char)%d \n", sizeof(char));
    char c = 255;
    // char 是一个字节，一个字节是8位（00000000 ~ 11111111）且以补码的方式表示的
    // char 255 = 11111111 = -1
    // 补码的第一位用来表示是否是负数 1 是负数 0 是正数
    // 补码的表示范围 -128 ~ 127
    // 补码的0 00000000(0)
    // 补码的负数范围 10000000(-128) ~ 11111111(-1)
    // 补码的正数范围 00000001(1) ~ 01111111 (127)
    // -1 + 1 = 0
    //   11111111 -1
    //   00000001 1
    // 1 00000000 1超出8位舍弃所以结果位 0
    int i = 255;
    // int 是按计算机字长(多少位，例如32位，64位)来表示的
    // int 的范围 -2[n-1](2的n次方-1) ~ 2[n-1]-1(2的n次方-1的结果在-1)
    // n表示计算机的字长（多少位）例如32位的就是 -2[32-1] ~ 2[32-1]-1
    // 32位 (00000000 00000000 00000000 00000000 ~ 11111111 11111111 11111111 11111111)
    // int i = 255 = 00000000 00000000 00000000 11111111
    printf("c = %d,i = %d \n", c, i);
    unsigned char uc = 255;
    // unsigned 无符号的，纯正数没有补码（负数）
    // 255 = 11111111
    printf("uc = %d \n", uc);
    char tc = 127;
//    tc = tc + 1;
    // 在printf里面计算结果不一样
    // 要先++ 结果才正确
    printf("tc + 1 = %d \n", ++tc);
    char tc2 = -128;
//    tc2 = tc2 - 1;
    printf("tc2 - 1 = %d \n", --tc2);

    // 八进制 开头用0
    char oct = 010;

    // 十六进制 开头0x

    char hex = 0xa;

    // 转成十进制
    printf("oct = %d, hex = %d\n", oct, hex);

    // 原来进制表示 十六进制根据x的大小写来显示十六进制的大小写的
    printf("oct = 0%o, hex = 0x%x, 0x%X\n", oct, hex, hex);


    return 0;
}